import 'package:places/domain/sight.dart';

const List<Sight> mocks = [
  Sight(
    'Астраханский кремль',
    46.349872,
    48.031956,
    'some_url',
    'Целостный ансамбль памятников оборонного зодчества, культовой и гражданской архитектуры',
    'Историко-архитектурный комплекс',
  ),
  Sight(
    'Памятник Петру I',
    46.347543009464154,
    48.0161004460226,
    'some_url',
    'Энергично шагающая фигура царя и одновременно смотрящая в сторону Волги',
    'Памятник',
  ),
  Sight(
    'Сарай Бату',
    47.23909365443894,
    47.37320713068174,
    'some_url',
    'Средневековый город, столица Золотой Орды',
    'Культурно-исторический комплекс',
  ),
];
